{
    "C12": "<p>El propósito de esta técnica es especificar el tamaño de fuente de texto proporcionalmente, de forma que las aplicaciones de usuario puedan escalar el contenido con eficacia. El aumento del tamaño del contenido es, en primer término, una responsabilidad de las aplicaciones de usuario pero la responsabilidad del autor es crear contenido web que no le impida a las aplicaciones de usuario escalar efectivamente el texto.</p><p>La intención es asegurar que el texto procesado visualmente, incluyendo los controles basados en texto, puedan ser aumentados de tamaño para que las personas con problemas visuales puedan leerlo sin necesidad de usar ayudas técnicas. Ejemplos:</p><p><code>strong {font-size: 120%}<br/>strong {font-size: 1.2em}</code></p>",
    "C19": "<p>Esta técnica describe cómo alinear los bloques de texto a la izquierda o a la derecha al establecer la propiedad <code>text-align</code> de CSS. Las personas con ciertas dificultades cognitivas tienen serios problemas para leer los bloques de texto que están justificados (alineados tanto al margen izquierdo como al derecho). En los textos justificados, los espacios desiguales entre las palabras pueden provocar 'calles' de espacios blancos que recorren varias líneas dificultando la lectura. En los textos justificados también se pueden producir acercamiento exagerados entre algunas palabras, de modo que resulta difícil ubicar la separación entre ellas. Ejemplo:</p><p><code>p.left {text-align: left}<br/>p.right {text-align: right}</code></p>",
    "C21": "<p>Muchas personas con algunos tipos de discapacidad cognitiva tienen dificultades para seguir las líneas de texto cuando en un bloque de texto las líneas están muy juntas debido a un espaciado de línea simple. Un espacio de entre 1,5 y 2 les permite iniciar una nueva línea con mayor facilidad una vez que han terminado la anterior. Los espacios adicionales entre líneas y párrafos le permiten a estas personas ubicar mejor la línea siguiente y reconocer cuando llegaron al final de cada párrafo. Para ellos es aún mejor si existen diferentes opciones, por ejemplo, un espacio y medio y doble espaciado entre líneas. Ejemplo:</p><p><code>p {line-height: 150%;}</code></p>",
    "C22": "<p>El propósito de esta técnica es demostrar cómo se pueden utilizar las CSS para controlar la presentación visual del texto. Esto permitirá a los usuarios modificar, a través de la aplicación de usuario, las características visuales del texto para satisfacer sus necesidades.</p><p>Las CSS benefician la accesibilidad principalmente por la separación de la estructura del documento de su presentación. Las hojas de estilo fueron diseñadas para permitir un control preciso -por fuera del sistema de marcas- del espaciado entre caracteres, alineación del texto, la posición del objeto en la página, las características de la fuente, etc. Al separar el estilo del sistema de marcas, los autores pueden simplificar y limpiar el marcado en su contenido, logrando al mismo tiempo que sea más accesible. Ejemplos:</p><p><code>code {font-family:'Courier New', Courier, monospace}<br/>.right {text-align: right;}<br/>strong.largersize {font-size: 1.5em;}<br/>.highlight {font-weight:bold; color:#990000;}</code></p>",
    "C24": "<p>El propósito de esta técnica es que los usuarios puedan aumentar el tamaño del texto sin tener que desplazarse horizontalmente para leer una línea de texto. Para utilizar esta técnica, el autor debe especificar el ancho de los contenedores de texto usando valores de porcentaje.</p><p>Verifique que sea posible ampliar en un 200% los textos sin requerir el uso de las barras de desplazamiento horizontal para leer cualquier línea de texto.</p><p>Cuando se brinda la posibilidad de ajustar el texto se está permitiendo que el texto sea ampliado sin necesidad de efectuar desplazamientos laterales para ver todo el contenido. Cuando esto es posible se dice que el texto fluye y permite, a las personas con baja visión y con problemas cognitivos, incrementar el tamaño del texto sin sentirse desorientadas. Ejemplo:</p><p><code>div#container {width: 80%}</code></p>",
    "C9": "<p>El propósito de esta técnica es proporcionar un mecanismo que permita agregar imágenes puramente decorativas e imágenes usadas para dar formato visual al contenido sin necesidad de marcas adicionales en el contenido. Esto hace posible que las ayudas técnicas ignoren el contenido no textual. Cuando las imágenes son decorativas es aceptable el uso del atributo <code>alt</code> nulo pero las imágenes que no transmiten información ni proporcionan alguna funcionalidad deberían incluirse mediante CSS. Ejemplos:</p><p><code>body {background: #ffe url('/images/home-bg.jpg') repeat;}<br/>ul {list-style-image: url('bullet.gif')}<br/>p:before {content: url('smiley.gif')}</code></p>",
    "F16": "<p>En este fallo hay un contenido que se mueve o se desplaza que no puede ser puesto en pausa y reanudado por el usuario. El contenido que se mueve o se actualiza puede representar una barrera para cualquier persona con dificultades para leer velozmente los textos estáticos como así también para quienes tienen problemas para seguir objetos en movimiento. También puede ocasionar problemas a los lectores de pantalla. El contenido en movimiento puede resultar una severa distracción para algunas personas.</p>",
    "F17": "<p>El propósito de esta técnica es asegurar que las páginas web puedan ser interpretadas de forma coherente por las aplicaciones de usuario, incluyendo las ayudas técnicas. Si es ambigua, las distintas aplicaciones de usuario pueden presentar diferente información a sus usuarios. Los usuarios de ayudas técnicas, por ejemplo, pueden tener una información distinta a la que se presenta a los usuarios de otras aplicaciones corrientes.</p><p>Algunos elementos y atributos en los lenguajes de marcas requieren tener valores únicos y, si este requisito no se cumple, el resultado puede ser irregular o el contenido puede no tener una única forma de ser resuelto. Por ejemplo, cuando los valores del atributo <code>id</code> no son únicos, son particularmente problemáticos cuando hacen referencia a las etiquetas, encabezados de tablas de datos o se utilizan como identificadores de fragmentos porque las aplicaciones de usuario no tienen suficiente información para determinar las relaciones esenciales (es decir, para determinar qué etiqueta va con qué elemento).</p>",
    "F24": "<p>Los usuarios con pérdida de visión o capacidad cognitiva, con problemas de lenguaje y de aprendizaje suelen preferir combinaciones específicas de colores de primer plano y de fondo que les facilitan ver la página. Muchas aplicaciones permiten a los usuarios elegir los colores de primer plano o de fondo que les gustaría ver cuando los colores no han sido especificados por el autor.</p><p>A menos que un autor especifique los colores de primer plano y de fondo no podrá garantizar que el usuario tendrá un contraste que cumpla con los requisitos de contraste. Si el autor especifica un color del texto en primer plano, entonces debería especificar también un color de fondo que tenga suficiente contraste con el primer plano y viceversa.</p><p>No es estrictamente necesario que ambos colores se encuentren definidos en la misma regla CSS, aunque es una práctica recomendable. Dado que las propiedades de color CSS se heredan de los elementos padres, es suficiente con que ambos colores se definan ya sea directamente o a través de la herencia. Ejemplo:</p><p><code>div {color: white; background-color: black;}</code></p>",
    "F25": "<p>Este fallo describe una condición de error cuando la página web tiene un título pero el título no identifica el contenido o el propósito de la página web. Por ejemplo, si un sitio generado con plantillas incluye el mismo título para cada página del sitio, el título no se podrá usar para diferenciar las páginas. La técnica correcta es ayudar a los usuarios a encontrar el contenido y orientarse en él asegurando que cada página web tenga un título descriptivo y único.</p><p>Los títulos señalan la ubicación actual sin requerirle a usuario que lea o interprete el contenido de la página. Cuando el título aparece en los mapas de sitio o en una lista de resultados de búsqueda, los usuarios pueden identificar más rápidamente el contenido que necesitan. Las aplicaciones de usuario hacen que el título de la página sea fácilmente disponible para que el usuario identifique la página.</p>",
    "F30": "<p>Este fallo describe una condición de error para todas las técnicas que implican alternativas textuales. Ejemplos de texto que no sirve como alternativa son las palabras de relleno como 'espacio', 'imagen' o 'foto' que se colocan en el lugar de la alternativa textual en las imágenes. Si el texto de la alternativa textual no se puede usar en lugar del contenido no textual se produce este fallo porque, de hecho, no es una alternativa para el contenido no textual.</p>",
    "F4": "<p>Las CSS definen el valor <code>blink</code> para la propiedad <code>text-decoration</code>. Cuando se utiliza, hace que cualquier texto en un elemento con esta propiedad parpadee a una velocidad predeterminada. Esto no puede ser interrumpido por el usuario ni puede ser desactivado por una preferencia de la aplicacion de usuario. El parpadeo continúa mientras se muestra la página.</p><p>Ciertos grupos de usuarios, en particular aquellos con desórdenes de atención, encuentran distractivo el contenido parpadeante, dificultando su concentración en otras partes de la página. Por lo tanto, el contenido que usa <code>text-decoration:blink</code> es un fallo ya que el parpadeo puede continuar durante más de cinco segundos.</p>",
    "F40": "<p>El código <code><meta http-equiv='refresh' content='{tiempo-de-espera}; url={dirección}'></code> se usa a menudo para redirigir automáticamente a los usuarios. Cuando esto ocurre después de un retardo de tiempo, es un cambio inesperado de contexto que puede interrumpir al usuario. Debe asegurarse que los usuarios puedan completar una tarea sin cambios inesperados en el contenido o contexto que sean el resultado de un límite de tiempo.</p><p>Es aceptable usar el elemento meta para crear una redirección cuando el tiempo de espera se establece en cero, ya que la redirección es instantánea y no se percibe como un cambio de contexto. Sin embargo, es preferible utilizar métodos del lado del servidor para lograr esto.</p>",
    "F41": "<p>El código <code><meta http-equiv='refresh' content='{tiempo-de-espera}'></code> se usa a menudo para actualizar periódicamente las páginas. Si el intervalo de tiempo es demasiado corto y no hay manera de desactivar la opción de apagar el refresco automático, las personas ciegas no tienen tiempo suficiente para que sus lectores de pantalla lean la página antes de que ésta se actualice de forma inesperada y hace que el lector de pantalla comience nuevamente la lectura desde la parte superior. Los usuarios videntes también pueden ser desorientados por la actualización inesperado.</p><p>Cualquier proceso que ocurra sin ser iniciado por el usuario después de un cierto lapso o a un ritmo periódico se considera límite de tiempo. Las personas con ceguera, baja visión, problemas de destreza y limitaciones cognitivas pueden requerir más tiempo para leer el contenido o llevar a cabo funciones como el rellenado de formularios. Si las funciones web se basan en el tiempo, será mas difícil para algunos usuarios realizar las acciones requeridas antes de alcanzar el límite de tiempo.</p>",
    "F46": "<p>Este fallo describe un error que se produce cuando una tabla que se utiliza sólo para el diseño incluye elementos <code>th</code>, un atributo <code>summary</code> o un elemento <code>caption</code>. Esto es un error ya que se usan marcadores estructurales (o semánticos) sólo para controlar la presentación. La intención del elemento <code>table</code> en HTML y XHTML es presentar datos. Las ayudas técnicas utilizan la estructura de una tabla HTML o XHTML para presentar los datos al usuario de una manera lógica.</p><p>Aunque las WCAG 2 no prohíben el uso de tablas para maquetar, se recomiendan los diseños basados en CSS con el fin de conservar el significado semántico de los elementos de una tabla HTML y para adaptarse a la práctica de separar la presentación del contenido. Cuando se utiliza una tabla con fines de diseño no hay necesidad de marcar la presencia de celdas de encabezados de columnas o de filas. Del mismo modo, no hay necesidad de una descripción adicional de una tabla que sólo se utiliza para diseño de contenido. No incluya un elemento <code>caption</code> y no use el atributo <code>summary</code> para describir la tabla. Los atributos <code>summary</code> vacíos son aceptables en las tablas de diseño, pero no se recomiendan.</p>",
    "F47": "<p>El elemento <code>blink</code>, aunque no es parte de la especificación HTML o XHTML, tiene soporte en muchas aplicaciones de usuario. Cuando se utiliza, hace que cualquier texto en el elemento parpadee a una velocidad predeterminada. Esto no puede ser interrumpido por el usuario ni puede ser desactivado por una preferencia de la aplicacion de usuario. El parpadeo continúa mientras se muestra la página. El contenido que usa <code>blink</code> es un fallo porque ciertos grupos de usuarios, en particular aquellos con desórdenes de atención, encuentran distractivo el contenido parpadeante, dificultando su concentración en otras partes de la página.</p>",
    "F49": "<p>Aunque las WCAG 2 no prohíben el uso de tablas para maquetar, se recomiendan los diseños basados en CSS con el fin de conservar el significado semántico de los elementos de una tabla HTML y para adaptarse a la práctica de separar la presentación del contenido. Si se utiliza una tabla para el diseño es importante que el contenido tenga sentido al ser leído de modo lineal.</p><p>Las tablas presentan el contenido en dos dimensiones visuales, horizontal y vertical. Sin embargo, los lectores de pantalla presentan este contenido de dos dimensiones en el orden lineal del contenido, a partir de la primera celda de la primera fila y terminando con la última celda de la última fila.</p><p>Si la celda de una tabla contiene otra tabla anidada, el lector de pantalla leerá toda la tabla anidada antes de leer la siguiente celda en la tabla original. Como resultado, la secuencia significativa transmitida a través de la presentación visual puede no ser perceptible cuando el contenido es leído por un lector de pantalla.</p>",
    "F52": "<p>Algunos sitios web abren una nueva ventana cuando se carga una página para anunciar un producto o servicio. El propósito de esta técnica es asegurar que las páginas no desorienten a los usuarios mediante la apertura de una o más ventanas nuevas que capturan automáticamente el enfoque tan pronto como se carga una página. La intención es asegurar que la funcionalidad sea predecible para los usuarios cuando navegan por el documento y alentar a los diseñadores a crear contenido web que proporcione a los usuarios el control total sobre los cambios en el contexto.</p>",
    "F54": "<p>Cuando se usan manejadores de evento específicos de los dispositivos apuntadores como único mecanismo disponible para activar cierta función del contenido, los usuarios no videntes al igual que las personas que deben usar teclados alternativos no podrán acceder a la función del contenido.</p><p>La intención es asegurar que el contenido pueda ser operado a través del teclado o una interfaz de teclado. Al permitir esto el sitio resulta operable por personas no vidente (quienes no pueden usar dispositivos como el ratón que requiere la coordinación ojo-mano) al igual que para las personas que necesitan usar teclados alternativos o dispositivos de entrada que actúan como emuladores de teclado.</p>",
    "F55": "<p>El contenido que normalmente recibe el foco cuando se accede al contenido por teclado puede tener el foco eliminado por un script. Esto se hace a veces cuando el diseñador considera que el indicador de foco del sistema es antiestético. Sin embargo, el indicador de foco es una parte importante de la accesibilidad para los usuarios de teclado. Además, esta práctica elimina el foco del contenido completo, lo que significa que el contenido sólo puede ser operado por un dispositivo de apuntar, tal como un ratón. La intención es asegurar que existe al menos un modo de operar donde el indicador del foco del teclado puede ser ubicado visualmente.</p>",
    "F59": "<p>Este fallo demuestra cómo el uso de los elementos HTML genéricos para crear controles de interfaz de usuario pueden hacer que los controles resulten inaccesibles para las ayudas técnicas. Muchos elementos HTML tienen roles bien definidos, como los enlaces, los botones, campos de texto, etc. Los elementos genéricos, como <code>div</code> o <code>span</code> no tienen roles predefinidos. Cuando se utilizan estos elementos genéricos para crear controles de interfaz de usuario las ayudas técnicas pueden no tener la información necesaria para describir e interactuar con el control.</p><p>Cuando se usan los controles estándares de las tecnologías accesibles, es sencillo para las ayudas técnicas poder reunir información acerca de, activar (o establecer) y actualizar el estado de los controles de la interfaz de usuario presentes en el contenido. Si se crean controles personalizados o se programan elementos para la interfaz (en el código o mediante scripts) que tienen un papel y/o función distintos a lo habitual, entonces se deben tomar medidas adicionales para garantizar que los controles proporcionan la información necesaria a las ayudas técnicas.</p>",
    "F65": "<p>Este fallo describe una condición de error en las alternativas textuales. Si no hay una fuente de texto para proporcionar una alternativa para los elementos <code>img</code>, <code>area</code> e <code>input type='image'</code>, las ayudas técnicas no son capaces de identificar estos elementos o transmitir sus propósitos al usuario. El atributo <code>alt</code> sigue siendo la manera preferida para proporcionar un texto alternativo.</p><p>El propósito es lograr que la información transmitida por medio de contenido no textual sea accesible mediante el uso de las alternativas textuales. Los textos alternativos son el principal medio para hacer accesible la información ya que se pueden interpretar a través de cualquier modalidad sensorial (visual, auditiva o táctil) que mejor satisfaga las necesidades del usuario.</p>",
    "F68": "<p>Este fallo describe un error que ocurre cuando no se usa correctamente el elemento <code>label</code> para asociar explícitamente un control de formulario con una etiqueta. El texto de la etiqueta identifica el propósito del control. Un elemento <code>label</code> se asocia a un determinado control a través del atributo <code>for</code>, que debe ser el mismo que el valor del atributo <code>id</code> del control de formulario.</p><p>El elemento <code>label</code> <strong>no</strong> se usa en los siguientes casos porque las etiquetas para estos elementos están proporcionadas a través del atributo <code>value</code> (para los botones submit y reset), el atributo <code>alt</code> (para botones gráficos) o el contenido del propio elemento (button)</p><ul><li>Botones submit o reset (<code>input type='submit'</code> o <code>input type='reset'</code>)</li><li>Botones gráficos (<code>input type='image'</code>)</li><li>Campos ocultos (<code>input type='hidden'</code>)</li><li>Botones para scripts (elementos <code>button</code> o <code>input type='button'</code>)</li></ul>",
    "F77": "<p>Los valores duplicados de tipo <code>id</code> pueden ser problemáticos para las aplicaciones de usuario que dependen de este atributo para comunicar con precisión las relaciones entre las distintas partes del contenido a los usuarios. Por ejemplo, un lector de pantalla puede utilizar los valores <code>id</code> para identificar la cabecera aplicable a una celda de datos dentro de una tabla, o un control de entrada al que se aplica una etiqueta determinada. Si estos valores no son únicos, el lector de pantalla no será capaz de determinar mediante programación qué cabeceras están asociados con la celda de datos o qué control está asociado a la etiqueta o el nombre.</p>",
    "F84": "<p>Este fallo describe una condición común en enlaces como 'haga clic aquí' o 'más', donde es necesario tener el texto que lo rodea para entender su propósito. Muchas personas ciegas que usan lectores de pantalla llaman a un cuadro de diálogo que tiene una lista de los enlaces de la página para decidir dónde van a ir. Pero si muchos de los enlaces de esa lista simplemente dicen 'haga clic aquí' o 'más' no estarán en condiciones de utilizar esta característica en su lector de pantalla, que es una estrategia de navegación muy importante. Los enlaces con iguales destinos deben tener las mismas descripciones y aquellos con distintos propósitos y destinos deben tener diferentes descripciones.</p>",
    "F88": "<p>Las personas con ciertas dificultades cognitivas tienen serios problemas para leer los bloques de texto que están justificados (alineados tanto al margen izquierdo como al derecho). En los textos justificados, los espacios desiguales entre las palabras pueden provocar 'calles' de espacios blancos que recorren varias líneas dificultando la lectura. En los textos justificados también se pueden producir acercamiento exagerados entre algunas palabras, de modo que resulta difícil ubicar la separación entre ellas.</p>",
    "F89": "<p>Este error ocurre cuando el único contenido de un enlace es un contenido no textual, como una imagen, y dicho enlace no puede ser identificado porque el elemento no textual no tiene un texto alternativo. La intención es ayudar a los usuarios a entender el propósito de cada enlace para que puedan decidir si lo quieren seguir. Cuando el propósito de cada enlace puede ser identificado por su texto, estos pueden ser entendidos cuando están fuera de contexto, como cuando la aplicación de usuario proporciona una lista con todos los enlaces de la página.</p>",
    "G1": "<p>El propósito de esta técnica es proporcionar un mecanismo para evitar bloques de material que se repiten en múltiples páginas saltando directamente al contenido principal de la página. El primer elemento interactivo de la página debe ser un enlace que, al activarlo, mueve el foco más allá de cualquier otro contenido hasta el contenido principal. Es preferible que los enlaces sean visibles en todo momento, sin embargo, el criterio también se cumple si los enlaces se hacen visibles cuando reciben el foco del teclado.</p>",
    "G102": "<p>El propósito de esta técnica es proporcionar la información necesaria para comprender una abreviatura. Una abreviatura es la forma abreviada de una palabra, frase o nombre. Para la mayoría de las abreviaturas, proporcionando la palabra completa, frase o nombre es suficiente. En ciertos casos, proporcionar una explicación es más útil que la forma expandida original. Por ejemplo, para <abbr title=''>p.m.</abbr> es mejor brindar su explicación (después del mediodía, por la tarde) antes que su forma expandida (post meridiem). Ejemplo:</p><p><code><p>Las clases en la <abbr title='Universidad Tecnológica Nacional'>UTN</abbr> comienzan el 12 de abril.</p></code></p>",
    "G115": "<p>El propósito de esta técnica es marcar la estructura del contenido de la página utilizando los elementos semánticos adecuados. En otras palabras, los elementos se utilizan de acuerdo con su significado, no por la forma en que aparecen visualmente. La intención es asegurar que la información y las relaciones implícitas en el formato visual se mantengan cuando cambie el formato de la presentación.</p><p>Aunque los elementos de presentación implican una estructura visual -los usuarios pueden determinar encabezados, párrafos, listas, etc., a partir de los formatos convencionales-, no codifican la estructura de forma inequívoca para que las ayudas técnicas puedan interactuar con la página de forma efectiva. Con el uso de los elementos semánticos adecuados se asegura que la estructura esté a disposición de las aplicaciones de usuario.</p>",
    "G123": "<p>El propósito de esta técnica es proporcionar un mecanismo para eludir un bloque de contenido saltando al final del bloque. El primer enlace en el bloque o el enlace directamente anterior al bloque mueve el foco del teclado al contenido inmediatamente posterior al bloque. Cuando hay varios bloques para eludir, el usuario puede saltar de uno a otro usando estos enlaces. Los enlaces deben ser visibles siempre o cuando reciben el foco del teclado.</p>",
    "G125": "<p>El propósito de esta técnica consiste en hacer posible a los usuarios encontrar información adicional proporcionando enlaces a las páginas web relacionadas. Los enlaces son el mecanismo que hacen de la Web una red interconectada de contenido y la mayoría de los autores emplean esta técnica de forma automática al crear las páginas.</p>",
    "G130": "<p>El propósito de esta técnica es hacer que los títulos de las secciones dentro del contenido sean descriptivos. Los títulos y encabezados descriptivos colaboran entre sí para dar a los usuarios una visión general de los contenidos y su organización. Los encabezados descriptivos identifican secciones del contenido en relación tanto a la página en su conjunto como a otras secciones de la misma página. Los encabezados descriptivos ayudan a los usuarios a encontrar contenidos específicos y a orientarse dentro de la página web.</p>",
    "G134": "<p>El propósito de esta técnica es evitar las ambigüedades en las páginas web que, a menudo, tienen un código que no es válido según las especificaciones formales. La validación generalmente elimina ambigüedades ya que un paso esencial en la validación es comprobar el uso adecuado del sistema de marcas (en un lenguaje de marcas) o el código (en otras tecnologías). El resultado de esta prueba se obtuvo usando el Servicio de Validación de Marcas del W3C. La validación no necesariamente comprueba la plena conformidad con una especificación pero es el mejor medio para verificar automáticamente el contenido de las páginas.</p>",
    "G140": "<p>El propósito de esta técnica es facilitar la interacción de las ayudas técnicas con el contenido separando el contenido de su presentación. La codificación estructural es la indicación de elementos tales como títulos, párrafos, listas, tablas, etc. Por el contrario, la codificación de la presentación es la indicación de los efectos de formato como tipo de letra, color, tamaño, posición, bordes, etc.</p><p>Aunque las características de presentación implican visualmente una estructura -los usuarios pueden determinar los encabezados, párrafos, listas, etc., a partir de las convenciones de formato utilizadas- estas características no codifican la estructura de forma inequívoca para que las ayudas técnicas puedan interactuar con la página de forma eficaz. Proporcionar las capas de estructura, funcionalidad y presentación separadas permite que la semántica implícita en el formato pueda ser determinada por software a través de la capa de estructura.</p>",
    "G141": "<p>El propósito de esta técnica es garantizar que las secciones tengan encabezados que los identifiquen. En HTML, esto se hace usando los elementos de encabezado HTML (h1, h2, h3, h4, h5, h6). Estos permiten a las aplicaciones de usuario identificar automáticamente los encabezados de sección. Para facilitar la navegación y la comprensión de la estructura general del documento, los autores deben utilizar los encabezados correctamente anidados (por ejemplo, h1 seguido de h2, h2 seguido de h2 o h3, etc.).</p><p>Los encabezados indican la organización del contenido, facilitan su navegación y proporcionan un 'mapa' mental que ayuda a comprender el contenido. Otros elementos pueden complementar los encabezados para mejorar la presentación (por ejemplo, líneas horizontales o cajas), pero la presentación visual no basta para identificar las secciones de un documento.</p>",
    "G145": "<p>El propósito de esta técnica es proporcionar suficiente contraste entre el fondo y el texto de modo que las personas con visión moderadamente reducida (que no utilizan ayudas técnicas para realzar el contraste) puedan leer con facilidad. Los requisitos de contraste para el texto también se aplican a las imágenes de texto (texto que ha sido transformado en pixeles y luego almacenado en una formato gráfico). Se excluyen los textos que no transmiten ninguna información o son simplemente decorativos. Los textos de gran tamaño y con trazos gruesos son más fáciles de leer con poco contraste, por eso los requisitos de contraste para los textos de gran tamaño son menores.</p>",
    "G146": "<p>El propósito de esta técnica es poder presentar el contenido sin presentar barras de desplazamiento horizontal mediante el uso de técnicas de diseño que se adaptan al espacio horizontal disponible. Los diseños líquidos definen zonas de diseño que cambian de tamaño con el texto. Aunque así la disposición exacta varía, la relación de los elementos y el orden de lectura sigue siendo el mismo. Esta es una manera eficaz de crear diseños que se presentan bien en diferentes dispositivos y a los usuarios con diferentes preferencias de tamaño de fuente.</p><p>Cuando se brinda la posibilidad de ajustar el texto, se está permitiendo que el texto sea ampliado sin necesidad de efectuar desplazamientos laterales para ver todo el contenido. Cuando esto es posible se dice que el texto fluye y permite, a las personas con baja visión y con problemas cognitivos, incrementar el tamaño del texto sin sentirse desorientadas.</p>",
    "G162": "<p>Cuando las etiquetas de los campos de formulario se colocan donde el usuario las espera encontrar, es más fácil comprender los formularios complejos y localizar los campos específicos. Las etiquetas para la mayoría de los campos están situadas inmediatamente antes del campo, es decir, a la izquierda del campo o por encima de él. Las etiquetas para los controles de tipo <code>checkbox</code> o <code>radio</code> se colocan después del campo. Estas posiciones se definen porque son las más usuales y, por lo tanto, las más predecibles.</p><p>Las etiquetas se colocan antes de los campos de entrada de texto porque estos a veces varían de longitud y de este modo se las puede alinear verticalmente. Por el contrario, los controles de tipo <code>checkbox</code> y <code>radio</code> tienen un ancho uniforme mientras que las etiquetas no y colocando la etiqueta después permite que se las pueda alinear.</p>",
    "G88": "<p>El propósito de esta técnica es ayudar a los usuarios a encontrar el contenido y orientarse en él asegurando que cada página web tenga un título descriptivo. Los títulos señalan la ubicación actual sin requerirle a usuario que lea o interprete el contenido de la página. Cuando el título aparece en los mapas de sitio o una lista de resultados de búsqueda, los usuarios pueden identificar mas rápidamente el contenido que necesitan. El título de cada página web debe:</p><ul><li>Identificar el tema de la página</li><li>Tener sentido cuando se lee fuera de contexto, por ejemplo, mediante un lector de pantalla o en un mapa de sitio</li><li>Ser breve</li></ul>",
    "G90": "<p>El propósito de esta técnica es permitir que las personas que dependen de un teclado o de una interfaz de teclado puedan acceder a la funcionalidad del contenido. Para ello, se debe asegurar que todos los controladores de eventos desencadenados por dispositivos de apuntar, como el ratón, están asociados también con un evento basado en el teclado o proporcionar eventos redundantes, para el teclado y otros dispositivos específicos.</p>",
    "H2": "<p>El propósito de esta técnica es evitar la duplicación innecesaria que se produce cuando el documento contiene versiones icónicas y de texto de un mismo enlace. A menudo, el texto y el icono se presentan en enlaces individuales para crear una separación visual entre sí. Visualmente parecen ser el mismo enlace pero son experimentados por muchas personas como dos enlaces idénticos y puede resultar confuso. Para evitar esta situación, algunos autores omiten el texto alternativo de la imagen, pero esto es un error debido a que el texto alternativo no sirve al mismo propósito que el enlace gráfico. El método preferido para hacer frente a esto es poner el texto y la imagen en un solo enlace, y proporcionar un texto alternativo nulo a la imagen para eliminar la duplicación de texto. Ejemplo:</p><p><code><a href='productos.html'><img src='icono.gif' alt='' /> Página de productos</a></code></p>",
    "H24": "<p>El propósito de esta técnica es proporcionar textos alternativos que sirven al mismo propósito que las regiones seleccionables de un mapa de imagen. Un mapa de imagen es una imagen dividida en regiones activas definidas por elementos <code>area</code>. Cada zona es un enlace a otra página web o a otra parte de la página actual. El atributo <code>alt</code> de cada elemento <code>area</code> sirve al mismo propósito que la zona seleccionable de la imagen.</p>",
    "H25": "<p>Todos los documentos HTML y XHTML, incluyendo aquellos en los marcos individuales de un <code>frameset</code>, tienen un elemento <code>title</code> en la sección <code>head</code> que define, en una frase simple, el propósito del documento. Esto ayuda a los usuarios a orientarse dentro del sitio de forma rápida y sin tener que buscar información en el cuerpo de la página. Tenga en cuenta que el elemento <code>title</code> (obligatorio), que sólo aparece una vez en un documento, es diferente del atributo <code>title</code>, que se puede aplicar a casi todos los elemento HTML y XHTML.</p>",
    "H27": "<p>El propósito de esta técnica es proporcionar un texto alternativo para el contenido representado en el elemento <code>object</code>. El cuerpo del elemento <code>object</code> se puede utilizar para proporcionar una alternativa textual completa para el objeto o puede presentar un contenido no textual adicional al texto alternativo.</p>",
    "H32": "<p>El propósito de esta técnica es proporcionar un mecanismo que permita a los usuarios solicitar explícitamente cambios de contexto. El uso previsto de un botón de envío (<code>input type='submit'</code>, <code>input type='image'</code> o <code>button type='submit'</code>) es generar una petición HTTP que envía los datos introducidos en un formulario, por lo que es un control apropiado para provocar un cambio de contexto y es una práctica que no crea confusión entre los usuarios.</p>",
    "H33": "<p>El propósito de esta técnica es mostrar cómo usar un atributo <code>title</code> en un enlace para proporcionar texto adicional que describa el enlace. El atributo <code>title</code> se usa para proporcionar información adicional para aclarar o describir con más detalle el propósito de un enlace. Si la información complementaria proporcionada por el atributo <code>title</code> es algo que el usuario debe saber antes de seguir el enlace, como una advertencia, entonces debe ser proporcionada en el texto del enlace y no en el atributo <code>title</code>.</p>",
    "H35": "<p>El propósito de esta técnica es proporcionar una alternativa textual para el elemento <code>applet</code> usando el atributo <code>alt</code> para etiquetar el elemento y agregar la alternativa textual en el cuerpo del elemento <code>applet</code>. En esta técnica, ambos mecanismos son necesarios debido a las variaciones en el soporte de las distintas aplicaciones de usuario.</p>",
    "H36": "<p>Para los elementos <code>input</code> de tipo 'image', el atributo <code>alt</code> se utiliza para proporcionar una etiqueta funcional. Esta etiqueta indica la función del botón, pero no trata de describir la imagen. La etiqueta es especialmente importante si hay varios botones de envío en la página que conducen, cada uno, a resultados diferentes.</p><p>El elemento <code>input</code> se usa para crear muchos tipos de controles de formulario. A pesar de que las DTD de HTML y XHTML permiten el atributo <code>alt</code> en todos estos controles, debe ser usado sólo en los botones gráficos. El soporte de las aplicaciones de usuario a este atributo en otros tipos de controles de formulario no está bien definido y se usan otros mecanismos para etiquetar estos controles.</p>",
    "H37": "<p>Al usar el elemento <code>img</code>, especifique una breve alternativa textual con el atributo <code>alt</code>. El valor de este atributo se denomina 'texto alternativo'. Cuando una imagen contiene palabras que son importantes para la comprensión del contenido, el texto alternativo debe incluir esas palabras. Esto permitirá que el texto alternativo cumpla la misma función en la página que la imagen. Tenga en cuenta que no es necesario describir las características visuales de la imagen en sí, sino que se debe transmitir el mismo significado que la imagen.</p>",
    "H39": "<p>El propósito de esta técnica es asociar por software los títulos de las tablas de datos cuando los títulos se proporcionan en la presentación. El título de una tabla es un identificador de la tabla y actúa como un encabezado. El elemento <code>caption</code> es el marcado adecuado para tal texto y se asegura de que el identificador se asocie a la tabla, incluso visualmente. Además, usar el elemento <code>caption</code> permite que los lectores de pantalla naveguen directamente al título de la tabla si hay uno presente.</p><p>El elemento <code>caption</code> se puede utilizar aún si la tabla incluye un atributo <code>summary</code>. El elemento <code>caption</code> identifica la tabla mientras que el atributo <code>summary</code> ofrece una visión general de la finalidad o explica cómo navegar la tabla. Si se usan ambos, el título no debe duplicar la información en el resumen.</p>",
    "H42": "<p>El propósito de esta técnica es el uso de las marcas de encabezados en HTML y XHTML para proporcionar código semántico en los encabezados del contenido. Los elementos de encabezados (h1, h2, h3, h4, h5 y h6) permitirán a las ayudas técnicas presentar el encabezado de un texto a los usuarios. Un lector de pantalla puede reconocer el código y anunciar el texto como encabezado con su nivel y proporcionar algún otro indicador auditivo. Los lectores de pantalla también son capaces de navegar por las marcas de encabezados, algo que para los usuarios puede ser una manera eficaz de encontrar más rápidamente el contenido de interés. Las ayudas técnicas que alteran la presentación visual del autor también serán capaces de proporcionar una presentación visual alternativa para los encabezados.</p>",
    "H43": "<p>El propósito de esta técnica es asociar cada celda de datos (en una tabla de datos) con las cabeceras apropiadas. Esta técnica agrega un atributo <code>headers</code> a cada celda de datos (elemento <code>td</code>). También agrega un atributo <code>id</code> a cualquier celda utilizada como cabecera para otras celdas. El atributo <code>headers</code> de una celda contiene una lista de los atributos <code>id</code> de las celdas de encabezado asociadas. Si hay más de un <code>headers</code>, deben estar separados por espacios.</p><p>Esta técnica se utiliza cuando las celdas de datos están asociadas con más de una fila y/o una columna de encabezados. Esto permite que los lectores de pantalla lean los encabezados asociados a cada celda de datos cuando las relaciones son demasiado complejas para ser identificadas mediante el elemento <code>th</code> solo o el elemento <code>th</code> con el atributo <code>scope</code>. Esta técnica también hace que las relaciones complejas se puedan percibir cuando cambia el formato de presentación.</p>",
    "H44": "<p>El propósito de esta técnica es utilizar el elemento <code>label</code> para asociar explícitamente un control de formulario con una etiqueta. Una etiqueta se asocia a un control de forma explícita a través del atributo <code>for</code>. El valor del atributo <code>for</code> debe ser el mismo que el valor del atributo <code>id</code> del control de formulario. El atributo <code>id</code> puede tener el mismo valor que el atributo <code>name</code> pero ambos se deben proporcionar siempre, y el <code>id</code> debe ser único en la página.</p><p>Un beneficio adicional de esta técnica es un área de selección más grande ya que al hacer clic, tanto en la etiqueta como en el control, se activará el control. Esto puede ser útil para los usuarios con dificultades motrices. Los elementos que utilizan etiquetas asociadas explícitamente son:</p><ul><li><code>input</code> (de tipo <code>'text'</code>, <code>'checkbox'</code>, <code>'radio'</code> o <code>'file'</code>)</li><li><code>textarea</code></li><li><code>select</code></li></ul>",
    "H45": "<p>El propósito de esta técnica es proporcionar la información en un archivo identificado por el atributo <code>longdesc</code> cuando una alternativa textual breve no transmite adecuadamente la función o la información proporcionada por la imagen. El atributo <code>longdesc</code> es un URI cuyo destino contiene una descripción extensa de la imagen. Los autores pueden proporcionar la descripción mediante la inclusión del texto en un recurso separado o en la misma página que contiene la imagen.</p>",
    "H46": "<p>El propósito de esta técnica es proporcionar un contenido alternativo para el elemento <code>embed</code> en un elemento <code>noembed</code>, que sólo será procesado si no existe soporte para <code>embed</code>. Si bien se puede colocar en cualquier lugar de la página, es una buena idea incluir <code>noembed</code> como un elemento hijo de <code>embed</code> de manera que sea claro para las ayudas técnicas que una alternativa textual está asociada con ese elemento.</p>",
    "H48": "<p>El propósito de esta técnica es crear listas de elementos relacionados utilizando los elementos de lista apropiados. El elemento <code>ol</code> se usa cuando la lista está ordenada y el elemento <code>ul</code> se utiliza cuando la lista no está ordenada. Las listas de definiciones (<code>dl</code>) se usan para agrupar términos con sus definiciones.</p><p>Cuando se utiliza un marcado que da formato visual a los elementos como una lista pero no indica la relación entre los elementos, los usuarios pueden tener dificultades para navegar la información. Un ejemplo de este formato visual es incluir asteriscos al principio de cada elemento de la lista y usar <br> para separar los elementos.</p>",
    "H51": "<p>El propósito de esta técnica es presentar información tabular de una manera que preserve las relaciones dentro de la información, incluso cuando los usuarios no puedan ver la tabla o el formato de presentación es cambiado. La información se considera tabular cuando existen relaciones lógicas entre texto, números, imágenes u otros datos en dos dimensiones (vertical y horizontal). Estas relaciones son representadas en columnas y filas, y las columnas y las filas deben ser reconocibles a fin de que las relaciones lógicas puedan ser percibidas. Utilizando el elemento <code>table</code> con los elementos hijos <code>tr</code>, <code>th</code> y <code>td</code> hace que estas relaciones resulten perceptibles.</p><p>Técnicas tales como el uso de tabuladores para crear columnas o usar el elemento <code>pre</code> son puramente visuales y las relaciones lógicas implícitas visualmente se pierden si el usuario no puede ver la tabla o se cambia la presentación visual. Aunque las WCAG no prohíben el uso de tablas para maquetar, se recomienda usar diseños basados en CSS para conservar el sentido semántica del elemento <code>table</code> definido en HTML y XHTML, y para cumplir con la práctica de separar la presentación del contenido.</p>",
    "H57": "<p>El propósito de esta técnica es identificar el idioma predeterminado de un documento proporcionando el atributlo <code>lang</code> y/o <code>xml:lang</code> en el elemento <code>html</code>. Identificar el idioma del documento es importante para que las ayudas técnicas y las aplicaciones de usuario convencionales puedan procesar los textos con mayor fidelidad. Los lectores de pantalla pueden cargar las reglas de pronunciación adecuadas y los usuarios con discapacidad tendrán más posibilidades de entender el contenido. HTML sólo ofrece el uso del atributo <code>lang</code> mientras que XHTML 1.0 (como medida de transición) permite <code>lang</code> y <code>xml:lang</code> (ambos deben tener un mismo valor), y XHTML 1.1 sólo permite <code>xml:lang</code>.</p>",
    "H59": "<p>El propósito de esta técnica es describir cómo el elemento <code>link</code> puede proporcionar metadatos sobre la posición de una página HTML dentro de un conjunto de páginas web o puede ayudar a localizar el contenido en un conjunto de páginas. El valor de los atributos <code>rel</code> indica qué tipo de relación se está describiendo y el atributo <code>href</code> proporciona un vínculo al documento que tiene esa relación. Múltiples elementos <code>link</code> pueden proporcionar múltiples relaciones. Ejemplos:</p><p><code><link rel='Contents' href='contenidos.html' title='Tabla de contenidos' /><br/><link rel='Index' href='index.html' title='Indice' /></code></p>",
    "H63": "<p>El propósito de esta técnica es asociar las celdas de encabezados con celdas de datos en tablas complejas utilizando el atributo <code>scope</code>. El atributo <code>scope</code> se puede utilizar para aclarar la amplitud o el alcance de cualquier celda utilizada como encabezado. El alcance identifica si la celda es un encabezado de una fila, columna o grupo de filas o columnas. Los valores <code>row</code>, <code>col</code>, <code>rowgroup</code> y <code>colgroup</code> indican respectivamente estos posibles alcances.</p>",
    "H64": "<p>El propósito de esta técnica es demostrar el uso del atributo <code>title</code> en los elementos <code>frame</code> o <code>iframe</code> para describir el contenido de cada marco. Esto proporciona una etiqueta para el marco de modo que los usuarios pueden determinar a qué marco entrar y explorar en detalle. Tenga en cuenta que el atributo <code>title</code> etiqueta los marcos y es diferente del elemento <code>title</code> que etiqueta los documentos. Ambos deben ser usados siempre, ya que el primero facilita la navegación entre los marcos y el segundo aclara la ubicación actual del usuario.</p>",
    "H65": "<p>Los elementos <code>label</code> permiten asociar una etiqueta de texto con los controles de formulario para brindar información sobre los controles. El propósito de esta técnica es utilizar el atributo <code>title</code> para etiquetar los controles de formulario cuando el diseño visual no permite acomodar la etiqueta o cuando puede resultar confuso mostrar una etiqueta. Las aplicaciones de usuario, incluyendo las ayudas técnicas, pueden leer el atributo <code>title</code> que reemplaza la función de <code>label</code>.</p>",
    "H71": "<p>El propósito de esta técnica es proporcionar una agrupación semántica para los controles de formulario relacionados. Esto permite a los usuarios entender la relación de los controles e interactúar con el formulario más rápida y eficazmente. Los controles de formulario se pueden agrupar encerrándolos en el elemento <code>fieldset</code>. Todos los controles dentro de un <code>fieldset</code> quedan entonces relacionados. El primer elemento dentro de <code>fieldset</code> debe ser un elemento <code>legend</code>, que proporciona una etiqueta o descripción del grupo.</p><p>La agrupación de los controles es más importante para los botones <code>radio</code> y <code>checkbox</code> cuando los botones representan los valores de un mismo campo de envío. También puede ser útil para agrupar otros conjuntos de controles menos estrechamente relacionados que los botones <code>radio</code> y <code>checkbox</code>. Como regla general, se puede decir que, cuando un grupo de controles dentro de un formulario, requiere un encabezado adicional para proporcionar una descripción específica de ese grupo, el uso de <code>fieldset</code> y <code>legend</code> es apropiado.</p>",
    "H73": "<p>El propósito de esta técnica es proporcionar un breve resumen de cómo los datos se han organizado en una tabla o una breve explicación de cómo navegar la tabla. El atributo <code>summary</code> del elemento <code>table</code> pone esta información a disposición de las personas que utilizan lectores de pantalla; la información no se muestra visualmente. El resumen es útil cuando la tabla tiene una estructura compleja (por ejemplo, cuando hay varios encabezados de fila o columna, o cuando hay varios grupos de columnas o filas). El resumen también puede ser útil para las tablas de datos simples que contienen muchas columnas o filas de datos. El atributo <code>summary</code> puede ser utilizado si la tabla incluye un elemento <code>caption</code>. Si se usan ambos, el resumen no deberá duplicar el texto presentado en <code>summary</code>.</p>",
    "H88": "<p>Existe distintos tipos de documentos HTML y todos ellos se encuentran definidos en sus respectivas especificaciones, pero también están definidos en un lenguaje comprensible por las máquinas que especifica la estructura correcta, elementos y atributos de un tipo de HTML. Tal definición se denomina 'Document Type Definition' (Definición del Tipo de Documento) que se suele llamar, para abreviar, 'Doctype' o 'DTD'.</p><p>Las herramientas que procesan los documentos HTML como, por ejemplo, los navegadores web, necesitan conocer la DTD que utilizan los documentos. Por este motivo es que cada documento (X)HTML necesita, al principio, una declaración DTD con la cual la interpretación (y, como resultado, la representación) del documento será no sólo más rápida sino también consistente y libre de cualquier error que causaría un documento sin doctype.</p>",
    "SCR20": "<p>El propósito de esta técnica es ilustrar el uso combinado de eventos específicos del teclado y específicos del ratón con el código que tiene un script asociado con un evento. El uso de los dos eventos en forma conjunta garantiza que el contenido puede ser operado por una amplia gama de dispositivos. Por ejemplo, un script puede realizar la misma acción, cuando se detecta una pulsación de tecla, que cuando se hace clic en un botón del ratón. Se debe proporcionar un controlador de eventos del teclado que ejecuta la misma función que el manejador de eventos del ratón. Estas son algunas correspondencias:</p> <ul><li>mousedown - keydown</li><li>mouseup - keyup </li><li>mouseover - focus </li><li>mouseout - blur</li></ul>"
}